#데이터프레임 그룹분석


1.   피봇테이블
2.   그룹바이

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

## pivot method

In [3]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [4]:
#행인덱스, 열인덱스, 데이터
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [5]:
df1.pivot(['지역','도시'], '연도', '인구')

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

##그룹분석

In [7]:
iris = sns.load_dataset('iris')
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [8]:
iris.groupby(iris.species).agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [9]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [10]:
df2.groupby(df2['key1']).sum()

      data1  data2
key1
A         8     80
B         7     70

In [11]:
df2.groupby(df2['key1'])['data2'].sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [13]:
df2.data2.groupby(df2.key1).sum()

key1
A    80
B    70
Name: data2, dtype: int64

##egg()

In [14]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

In [15]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [16]:
iris.groupby(iris.species).agg(lambda x: x.max()/x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [17]:
iris.groupby(iris.species).apply(lambda x: x.max()/x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [18]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [20]:
iris.groupby(iris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [21]:
mpg = sns.load_dataset('mpg')

In [22]:
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [24]:
mpg['manufactuer'] = mpg.name.apply(lambda x : x.split()[0]) #데이터 프레임에 apply적용

In [ ]:
mpg['model'] = mpg.name.apply(lambda x : ' '.join(x.split()[1:])) 
#스플릿 하면 전부 따로 인식하는데 끝에서 단어를 불러오고 ' '.join() 하면 'rebel sst'과 같이 하나로 묶임

In [25]:
def q3cut(s) :
    return pd.qcut(s, 3, labels=['소', '중', '대']).astype(str)

In [ ]:
iris["pental_length_class"]  = iris.groupby(iris.species)['petal_length'].transform(3cqut)
iris["pental_length"]


##pivot_table

In [27]:
df1.pivot( '도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [28]:
df1.pivot_table('인구', '도시', '연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [29]:
df1.pivot_table('인구', '도시', '연도', margins=True, margins_name ='합계')

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [31]:
df1.pivot_table('인구', ['지역','도시'], '연도', margins=True, margins_name ='합계')

연도           2005       2010       2015            합계
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3.451492e+06
수도권 서울  9762546.0  9631482.0  9904312.0  9.766113e+06
    인천        NaN   263203.0  2890451.0  1.576827e+06
합계      6637546.5  4429292.0  5414500.0  5.350809e+06

##tips dataset  사례

In [32]:
tips = sns.load_dataset('tips')

In [33]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [34]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [37]:
tips['tip_percent'] = np.round(tips.tip / tips.total_bill *100, 2)

In [38]:
tips.describe()

       total_bill         tip        size  tip_percent
count  244.000000  244.000000  244.000000   244.000000
mean    19.785943    2.998279    2.569672    16.079754
std      8.902412    1.383638    0.951100     6.107020
min      3.070000    1.000000    1.000000     3.560000
25%     13.347500    2.000000    2.000000    12.910000
50%     17.795000    2.900000    2.000000    15.475000
75%     24.127500    3.562500    3.000000    19.147500
max     50.810000   10.000000    6.000000    71.030000

In [39]:
tips.groupby(tips.sex).count()

        total_bill  tip  smoker  day  time  size  tip_percent
sex
Male           157  157     157  157   157   157          157
Female          87   87      87   87    87    87           87

In [40]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_percent
sex
Male           157  157     157  157   157   157          157
Female          87   87      87   87    87    87           87

In [41]:
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [44]:
#성별, 흡연 여부에 따른 평균팁비율
#tips.groupby('sex').tip_percent.mean() 시리즈로 출력됨
tips.groupby('sex')[['tip_percent']].mean()

        tip_percent
sex
Male      15.764713
Female    16.648276

In [45]:
tips.groupby('smoker')[['tip_percent']].mean()

        tip_percent
smoker
Yes       16.319140
No        15.932318

In [47]:
tips.groupby(['sex','smoker'])[['tip_percent']].mean()

               tip_percent
sex    smoker
Male   Yes       15.276667
       No        16.066598
Female Yes       18.214545
       No        15.691111

In [50]:
tips.pivot_table('tip_percent', ['sex', 'smoker'])

               tip_percent
sex    smoker
Male   Yes       15.276667
       No        16.066598
Female Yes       18.214545
       No        15.691111

In [51]:
#요일에 따른 팁의 비율
tips.groupby('day')[['tip_percent']].mean()

      tip_percent
day
Thur    16.126452
Fri     16.991579
Sat     15.314598
Sun     16.689605

In [52]:
#점심저녁여부
tips.groupby('time')[['tip_percent']].mean()

        tip_percent
time
Lunch     16.411765
Dinner    15.951477

In [54]:
#요일과 점심저녁 여부
tips.groupby(['day','time'])[['tip_percent']].mean()

             tip_percent
day  time
Thur Lunch     16.129016
     Dinner    15.970000
Fri  Lunch     18.875714
     Dinner    15.892500
Sat  Lunch           NaN
     Dinner    15.314598
Sun  Lunch           NaN
     Dinner    16.689605

In [55]:
#요일과 점심저녁 여부(피봇)
tips.pivot_table('tip_percent', 'time', 'day')

day          Thur        Fri        Sat        Sun
time
Lunch   16.129016  18.875714        NaN        NaN
Dinner  15.970000  15.892500  15.314598  16.689605

In [57]:
#인원수에 따라서 (데이터, [컬럼, 컬럼2, 컬럼3])
tips.pivot_table('tip_percent', ['time', 'size'], 'day' )

day               Thur        Fri        Sat        Sun
time   size
Lunch  1     18.170000  22.380000        NaN        NaN
       2     16.401277  18.196000        NaN        NaN
       3     14.460000  18.770000        NaN        NaN
       4     14.552000        NaN        NaN        NaN
       5     12.140000        NaN        NaN        NaN
       6     17.366667        NaN        NaN        NaN
Dinner 1           NaN        NaN  23.180000        NaN
       2     15.970000  16.267273  15.528679  18.086410
       3           NaN        NaN  15.142222  15.266000
       4           NaN  11.770000  13.828462  15.317222
       5           NaN        NaN  10.660000  15.986667
       6           NaN        NaN        NaN  10.380000

In [58]:
#어떤 요인이 가장 크게 작용하는가?
tips.groupby(['day','time'])[['tip_percent']].agg(lambda x : x.max() / x.min())

             tip_percent
day  time
Thur Lunch      3.647945
     Dinner     1.000000
Fri  Lunch      2.203059
     Dinner     2.543436
Sat  Lunch           NaN
     Dinner     9.148876
Sun  Lunch           NaN
     Dinner    11.957912

In [59]:
tips.groupby(['sex','smoker'])[['tip_percent']].agg(lambda x : x.max() / x.min())

               tip_percent
sex    smoker
Male   Yes       19.952247
       No         4.066852
Female Yes        7.388298
       No         4.448944

In [63]:
def peak_to_peak(x):
    return x.max()/x.min()
tips.groupby(['sex','smoker'])[['tip_percent']].agg(['mean', peak_to_peak] )

              tip_percent
                     mean peak_to_peak
sex    smoker
Male   Yes      15.276667    19.952247
       No       16.066598     4.066852
Female Yes      18.214545     7.388298
       No       15.691111     4.448944

In [65]:
tips.groupby(['sex','smoker'])[['tip_percent']].agg(['mean', lambda x : x.max() / x.min()] )

              tip_percent
                     mean <lambda_0>
sex    smoker
Male   Yes      15.276667  19.952247
       No       16.066598   4.066852
Female Yes      18.214545   7.388298
       No       15.691111   4.448944

In [66]:
tips.groupby(['sex','smoker'])[['tip_percent']].agg(['mean', 'std', lambda x : x.max() / x.min()] )

              tip_percent
                     mean       std <lambda_0>
sex    smoker
Male   Yes      15.276667  9.058490  19.952247
       No       16.066598  4.184634   4.066852
Female Yes      18.214545  7.159585   7.388298
       No       15.691111  3.641717   4.448944